<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"a1a1ff70dfbdda7374be55e3b88979b764fc6548b9f4a726cf8a421bb02114f2","plan_job_ref":"Job Staging Environment #73 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/8412637940","plan_out_hash":"6527a1eb67b23c1d3d1f8871949d7652fdf62a7841eb6786c6dc2b98e79b6498","plan_hash":"8f802a5729fd627b451d159d21f340556b2a1009ad21a2a64a69dd57988a6890","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "EOUIG3G6N7CQQ"
        tags                           = {}
#        (21 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (3 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                   = "31973dce44f28469610c68ff1ba3169f" -> "2197cca1e39617881aa77a0703c27e36"
        id                     = "index.html"
        tags                   = {}
!~      version_id             = "********************************" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #73](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/8412637940)